---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.CwpReuseExistingLevels
source: html/cf1131c2-f408-e02b-c8cd-fa6abba010bf.htm
---
# Autodesk.Revit.DB.ParameterTypeId.CwpReuseExistingLevels Property

"Reuse matching Levels"

## Syntax (C#)
```csharp
public static ForgeTypeId CwpReuseExistingLevels { get; }
```